-- MySQL dump 10.13  Distrib 5.7.9, for Win64 (x86_64)
--
-- Host: localhost    Database: majiang
-- ------------------------------------------------------
-- Server version	5.7.9-log

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `fight`
--

DROP TABLE IF EXISTS `fight`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `fight` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `east` int(11) NOT NULL DEFAULT '0',
  `west` int(11) NOT NULL DEFAULT '0',
  `south` int(11) NOT NULL DEFAULT '0',
  `north` int(11) NOT NULL DEFAULT '0',
  `score` varchar(255) NOT NULL DEFAULT '',
  `gameId` int(11) NOT NULL DEFAULT '0',
  PRIMARY KEY (`id`),
  UNIQUE KEY `id_UNIQUE` (`id`),
  KEY `game_id_index` (`gameId`)
) ENGINE=InnoDB AUTO_INCREMENT=60 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `fight`
--

LOCK TABLES `fight` WRITE;
/*!40000 ALTER TABLE `fight` DISABLE KEYS */;
INSERT INTO `fight` VALUES (1,0,0,-10,10,'三色三步高，断幺，平和',1),(2,-11,11,0,0,'三色三同顺，平和，坎张',1),(3,0,-40,40,0,'全大，三色三节高，四归一，明杠，幺九刻，花牌×4',1),(4,0,0,10,-10,'混一色，幺九刻，坎张，花牌×2',2),(5,-15,15,0,0,'花龙，平和，花牌×5',2),(6,9,-9,0,0,'全求人，无字，幺九刻，花牌',2),(7,-11,33,-11,-11,'五门齐，明杠，幺九刻，喜相逢，自摸，花牌',2),(8,16,0,-16,0,'小于五，双同刻，四归一',2),(9,-12,0,12,0,'碰碰和，双暗刻，单钓将，幺九刻×2，花牌',2),(10,-10,0,10,0,'三色三步高，箭刻，花牌×2',2),(11,-17,-17,51,-17,'小于五，双同刻，自摸，花牌×2',2),(12,-24,0,24,0,'小于五，抢杠和，幺九刻，喜相逢，花牌×2',2),(13,19,0,0,-19,'小于五，平和，一般高，喜相逢，坎张，花牌×2',3),(14,75,-25,-25,-25,'清龙，和绝张，平和，喜相逢，自摸，坎张',3),(15,0,0,0,0,'',3),(16,-23,69,-23,-23,'清龙，平和，喜相逢，自摸，边张，花牌×2',3),(17,-12,-12,36,-12,'五门齐，门风刻，自摸，坎张，花牌×2',3),(18,-9,-9,-9,27,'混一色，箭刻，自摸',3),(19,0,20,0,-20,'清龙，平和，缺一门，花牌',3),(20,-20,20,0,0,'清龙，门前清，无字，缺一门',3),(21,-22,22,0,0,'五门齐，三色三步高，门风刻，圈风刻，明杠，花牌×5',3),(22,-11,0,11,0,'五门齐，圈风刻，单钓将，明杠，喜相逢',3),(23,0,-11,11,0,'三色三步高，平和，花牌×3',3),(24,-11,0,11,0,'混一色，箭刻，单钓将，幺九刻，花牌',3),(25,20,0,-20,0,'混一色，碰碰和，双箭刻，幺九刻，花牌',3),(26,0,-14,14,0,'全不靠，花牌×2',3),(27,-10,-10,30,-10,'花龙，自摸，坎张',3),(28,0,16,0,-16,'五门齐，和绝张，门前清，圈风刻，花牌×2',3),(29,16,0,-16,0,'三色三同顺，平和，门前清，单钓将，老少副，花牌×2',3),(30,32,0,-32,0,'七对，五门齐，花牌×2',3),(31,11,-11,0,0,'碰碰和，无字，明杠，幺九刻×2，花牌',3),(32,-17,-17,51,-17,'大于五，四归一，明杠，自摸，花牌',3),(33,9,-9,0,0,'五门齐，单钓将，一般高，幺九刻',3),(34,10,0,-10,0,'混一色，箭刻，一般高，花牌',3),(35,96,-32,-32,-32,'七对，不求人，缺一门，花牌×3',3),(36,-15,-15,45,-15,'大于五，喜相逢，自摸，花牌',3),(37,-11,11,0,0,'五门齐，门风刻，单钓将，喜相逢，花牌',3),(38,-14,-14,-14,42,'五门齐，不求人，门风刻，花牌×2',3),(39,0,0,16,-16,'小于五，四归一，花牌×2',3),(40,-11,-11,-11,33,'五门齐，箭刻，幺九刻，自摸，坎张',3),(41,84,-28,-28,-28,'清一色，幺九刻，自摸，花牌×2',3),(42,0,-27,27,0,'七对，无字，缺一门，花牌',3),(43,0,-46,46,0,'清一色，一色三步高，坎张，花牌×5',3),(44,60,-20,-20,-20,'花龙，五门齐，单钓将，幺九刻，自摸，花牌×3',3),(45,0,0,23,-23,'大于五，三色三同顺，坎张，花牌×2',3),(46,-19,0,0,19,'清龙，花牌×3',3),(47,0,18,-18,0,'混一色，碰碰和，双暗刻，幺九刻×2，花牌×2',5),(48,-8,-8,24,-8,'不求人，单钓将，无字，连六，喜相逢',5),(49,-29,29,0,0,'全大，一般高，喜相逢，边张，花牌×2',5),(50,-17,17,0,0,'混一色，全求人，幺九刻×2，花牌×3',5),(51,-10,10,0,0,'三色三步高，平和，喜相逢，花牌',5),(52,222,-74,-74,-74,'小三元，混一色，幺九刻，自摸，花牌×2',5),(53,0,-11,11,0,'碰碰和，圈风刻，缺一门，幺九刻，花牌',5),(54,81,-27,-27,-27,'清一色，幺九刻，自摸，花牌',5),(55,11,-11,0,0,'花龙，无字，花牌×2',5),(56,93,-31,-31,-31,'七对，不求人，无字，花牌×2',5),(57,-10,-10,-10,30,'碰碰和，断幺，自摸，花牌',5),(58,0,28,-28,0,'七对，无字，缺一门，花牌×2',5),(59,-11,33,-11,-11,'三色三步高，平和，喜相逢，自摸，花牌',5);
/*!40000 ALTER TABLE `fight` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2016-05-12  0:49:40
